<template>
  <el-tabs v-model="activeName" style="padding-left: 8px;">


    <el-tab-pane name="first">

      <span slot="label"><i class="el-icon-attract"/>联系平台</span>
      <contact/>
    </el-tab-pane>


    <el-tab-pane name="second">

      <span slot="label" @click="refreshRecord"><i class="el-icon-message"/>我给平台的留言 </span>

      <record ref="recordChild"/>

    </el-tab-pane>


    <el-tab-pane name="third">


      <span slot="label"><i class="el-icon-question"/>使用帮助</span>


      <div>
        <blockquote class="my-blockquote">视频讲解</blockquote>
        <pre class="my-code">
 # 邮件服务器的SMTP地址，可选，默认为smtp
 # 邮件服务器的SMTP端口，可选，默认465或者25
 # 发件人（必须正确，否则发送失败）
 # 用户名，默认为发件人邮箱前缀
 # 密码（注意，某些邮箱需要为SMTP服务单独设置密码，如QQ和163等等）
 # 是否开启ssl，默认开启</pre>
        <blockquote class="my-blockquote">图文教程</blockquote>
        <pre class="my-code">更多帮助请查看文档：<a style="color:#009688" href="http://hutool.mydoc.io/#text_319499"
                                          target="_black">hutool工具包</a></pre>

        <blockquote class="my-blockquote">使用常见问题</blockquote>
        <p class="my-code"> 水电费水电费坚实的分解德生科技焚枯食淡</p>
      </div>
    </el-tab-pane>


    <el-tab-pane name="four">

      <span slot="label"><i class="el-icon-crop"/>关于昱升</span>

      <div>

        <blockquote class="my-blockquote">公司详情</blockquote>
        <div class="aboutYs">
          方正集团是北京大学于1986年投资创办的大型国有控股企业集团。王选院士是方正集团的技术奠基人，其发明的“汉字信息处理与激光照排系统”奠定了方正集团的起家之业。
          方正集团坚持“科技顶天、市场立地”的发展理念，矢志不移地践行“产学研深度融合”发展模式，服务国家发展战略，服务北大教学科研，促进科技成果转化。
          30余年来，方正集团伴随着中国改革开放进程不断发展壮大。方正集团以IT产业的不断深耕和发展为基础，逐步形成了IT、医疗、产业金融、产城融合等业务协同发展的产业格局，旗下拥有方正科技、方正控股、北大医药、北大资源、方正证券、中国高科等6家上市公司。
          截至2018年底，方正集团总资产3606亿元，净资产655亿元。2018年，方正集团年收入1333亿元，年净利润14.9亿元。目前，方正集团海内外员工合计约3.8万名。
          方正集团是首批6家“全国技术创新试点企业”之一，是国家120家“大型企业集团试点”之一，是“国家技术创新示范企业”之一，并曾获得“国家科技进步一等奖”、“国家十大科技成就”、“中国专利奖金奖”等奖项。目前，方正集团旗下拥有3000多名研发人员，拥有多个国家级企业技术中心、重点实验室、工程中心、博士后工作站。
          在“2019中国企业500强”中，方正集团排名中国第138位。在2019年度“中国电子信息百强企业”中，方正集团排名中国第5位。同时，方正是“中国驰名商标”，位居世界品牌实验室（World Brand
          Lab）评选的“中国500最具价值品牌”第86名、“亚洲品牌500强”第196名。在企业社会责任领域，方正集团荣获“人民企业社会责任奖”，入选国务院扶贫办2018年度“企业扶贫50佳案例”。
          方正集团旗下各大产业板块不断创新发展，并通过产业协同效应持续创造社会价值，形成了各具特色的竞争优势与行业影响力：
          ——IT板块以方正信息产业集团为业务主体，是中国自主创新的推动者和中国IT行业的领军企业。目前，IT板块形成了覆盖字库、出版印刷、集成电路（PCB、封装基板、芯片制造）、医疗信息化、智慧警务、智慧交通、互联网通信等领域的产业布局。方正集团名列2019年度中国电子信息百强企业第5位。
          ——医疗板块以北大医疗集团为业务主体，由北京大学医学部和方正集团共同设立。北大医疗以“品质+创新”作为核心战略，致力于医疗服务、医药工业、创新创投领域，努力打造国际化大健康龙头企业。目前，北大医疗集团旗下医疗机构床位数超过1万张，综合实力位居中国“社会办医医院集团100强”榜首。
          ——产业金融板块以方正物产集团、方正证券、北大方正人寿等为业务主体，业务涵盖大宗商品交易、证券、期货、基金、保险等领域。作为产融结合的实践者，方正集团不断推进产业与资本协同发展，不断探索产融结合新模式，服务实体经济、服务人民生活。
          ——产城融合板块以北大资源集团（北大科技园）等为业务主体，以高科技、文创等园区建设和运营以及创新孵化为核心业务，为科技成果转化、高新企业孵化、创新创业人才培养提供支撑和服务，积极践行和服务于国家创新驱动战略。
          方正集团植根北大，致力于持续提供卓越的产品与服务，为人们创造更智能、更健康、更富足的生活。我们以塑造一流专业团队、传承健康企业文化、实现产业报国理想为己任，做受人尊敬的大型企业集团。
        </div>

        <blockquote class="my-blockquote">平台详情</blockquote>
        <div class="aboutPlat">
          京东方科技集团股份有限公司（BOE）创立于1993年4月，是一家为信息交互和人类健康提供智慧端口产品和专业服务的物联网公司。核心事业包括端口器件、智慧物联和智慧医工三大领域。
          端口器件事业包括显示与传感器件、传感器及解决方案。作为全球半导体显示产业龙头企业，BOE（京东方）带领中国显示产业实现了从无到有、从有到大、从大到强。目前全球有超过四分之一的显示屏来自BOE（京东方），其超高清、柔性、微显示等解决方案已广泛应用于国内外知名品牌。
          智慧物联事业包括智造服务、IoT解决方案和数字艺术，可为智慧零售、智慧金融、数字艺术、商务办公、智慧家居、智慧交通、智慧政教、智慧能源等细分领域提供物联网整体解决方案。在数字艺术领域，BOE（京东方）推出数字艺术物联网产品——BOE画屏，实现科技与艺术完美结合；在商超零售等领域，BOE（京东方）提供价格管理、货架管理、客户行为分析等物联网新零售解决方案，实现零售O+O无缝衔接。
          智慧医工事业包括移动健康和健康服务。BOE（京东方）已推出移动健康管理平台，通过智能终端进行健康数据检测，基于人工智能和大数据算法，为用户提供生命体征数据监测解读、AI疾病风险预测、专家健康课程以及在线问诊、体检挂号等就医服务，让用户足不出户即可享受个性化的家庭健康管理服务。健康服务创新性的融合医疗、信息、人工智能和细胞工程等技术，聚焦数字医院、数字人体、再生医学、解决方案领域，为客户提供全方位、全生命周期的健康管理方案。
          2019年，BOE（京东方）新增专利申请量9657件，其中发明专利超90%，累计可使用专利超7万件，覆盖美国、欧洲、日本、韩国等国家和地区。美国专利服务机构IFI
          Claims发布数据显示，2019年BOE（京东方）全球排名跃升至第13位，美国专利授权量达2177件，同比增长33%，连续4年在IFI
          TOP50榜单中实现排名与美国专利授权量双增长；世界知识产权组织（WIPO）发布2019年全球国际专利申请（PCT）情况，BOE（京东方）以1864件PCT申请位列全球第六。
          BOE（京东方）在北京、合肥、成都、重庆、福州、绵阳、武汉、昆明、苏州、鄂尔多斯、固安等地拥有多个制造基地，子公司遍布美国、德国、英国、法国、瑞士、日本、韩国、新加坡、印度、俄罗斯、巴西、阿联酋等19个国家和地区，服务体系覆盖欧、美、亚、非等全球主要地区。
        </div>
      </div>

    </el-tab-pane>
  </el-tabs>
</template>

<script>
  import contact from './contact'
  import Record from "./record";

  export default {
    name: 'Help',
    components: {Record, contact},
    data() {
      return {
        activeName: 'first'
      }
    },
    methods: {

      refreshRecord() {
        this.$refs.recordChild.messageList();
      }


    }
  }
</script>

<style scoped>

  .aboutYs {
    line-height: 30px;

    color: #2c3e50;

  }

  .aboutPlat {
    line-height: 30px;

    color: #2c3e50;

  }

</style>
